<?php

/****************************************************************************************
	seo_url -  funkce sloužící k převodu textových řetězců na formát použitelný v URL,
			   tedy substituce všech speciálních a národně specifických znaků,
			   nahrazení mezer pomlčkami a převod na lowercase.
****************************************************************************************/

function seo_url ($title){
    $address = $title;
    		$table = array(
			'Š'=>'s', 'š'=>'s', 'ß'=>'ss','Đ'=>'dj', 'đ'=>'dj', 'Ž'=>'z', 'ž'=>'z', 'Č'=>'c', 'Ć'=>'c', 'Ç'=>'c',
			'ć'=>'c', 'č'=>'c', 'ç'=>'c', 'À'=>'a', 'Á'=>'a', 'Â'=>'a', 'Ã'=>'a', 'Ä'=>'a', 'Å'=>'a', 'Æ'=>'a',
			'à'=>'a', 'á'=>'a', 'â'=>'a', 'ã'=>'a', 'ä'=>'a', 'å'=>'a', 'æ'=>'a', 'È'=>'e', 'É'=>'e', 'Ě'=>'e',
			'Ê'=>'e', 'Ë'=>'e', 'è'=>'e', 'é'=>'e', 'ê'=>'e', 'ë'=>'e', 'ě'=>'e', 'Ì'=>'i', 'Í'=>'i', 'Î'=>'i',
			'Ï'=>'i', 'ì'=>'i', 'í'=>'i', 'î'=>'i', 'ï'=>'i', 'Ñ'=>'n', 'Ò'=>'o', 'Ó'=>'o', 'Ô'=>'o', 'Õ'=>'o',
			'Ö'=>'o', 'Ø'=>'o', 'ò'=>'o', 'ó'=>'o', 'ô'=>'o', 'õ'=>'o', 'ö'=>'o', 'ø'=>'o', 'ð'=>'o', 'Ù'=>'u',
			'Ú'=>'u', 'Û'=>'u', 'Ü'=>'u', 'Ů'=>'u', 'ù'=>'u', 'ú'=>'u', 'û'=>'u', 'ů'=>'u', 'Ý'=>'y', 'Þ'=>'B',
			'ñ'=>'n', 'Ý'=>'Y', 'ý'=>'y', 'þ'=>'b', 'ÿ'=>'y', 'Ŕ'=>'r', 'Ř'=>'r', 'ŕ'=>'r', 'ř'=>'r', 'ă'=>'a',
			'ź'=>'z', 'ł'=>'l', 'ť'=>'t', 'А'=>'a', 'а'=>'a', 'Б'=>'b', 'б'=>'b', 'В'=>'v', 'в'=>'v', 'Г'=>'g',
			'г'=>'g', 'Д'=>'d', 'д'=>'d', 'Е'=>'e', 'е'=>'e', 'Ё'=>'yo', 'ё'=>'yo','Ж'=>'zh', 'ж'=>'zh', 'З'=>'z',
			'з'=>'z', 'И'=>'i', 'и'=>'i', 'Й'=>'j', 'й'=>'j', 'К'=>'k', 'к'=>'k', 'Л'=>'l', 'л'=>'l', 'М'=>'m',
			'м'=>'m', 'Н'=>'n', 'н'=>'n', 'О'=>'o', 'о'=>'o', 'П'=>'p', 'п'=>'p', 'Р'=>'r', 'р'=>'r', 'С'=>'s',
			'с'=>'s', 'Т'=>'t', 'т'=>'t', 'У'=>'u', 'у'=>'u', 'Ф'=>'f', 'ф'=>'f', 'Х'=>'kh', 'х'=>'kh', 'Ц'=>'c',
			'ц'=>'c', 'Ч'=>'ch', 'ч'=>'ch', 'Ш'=>'sh', 'ш'=>'sh', 'Щ'=>'shch', 'щ'=>'shch', 'Ъ'=>'', 'ъ' =>'',
			'Ы'=>'y', 'ы'=>'y', 'Ь'=>'', 'ь'=>'', 'Э'=>'e', 'э'=>'e', 'Ю'=>'yu', 'ю'=>'yu', 'Я'=>'ya', 'я'=>'ya',
			'ď'=>'d', 'Ď'=>'D', 'ň'=>'n', 'Ň'=>'n', 'ę'=>'e', 'ś'=>'s', 'і'=>'i', 'Ў'=>'w', 'ў'=>'w',
        'Α'=>'a', 'α'=>'a', 'ά'=>'a', 'Β'=>'b', 'β'=>'b', 'Γ'=>'g', 'γ'=>'g', 'Δ'=>'d', 'δ'=>'d', 'Ε'=>'e', 'ε'=>'e', 'έ'=>'e', 
        'Ζ'=>'z', 'ζ'=>'z', 'Η'=>'i', 'η'=>'i', 'ή'=>'i', 'Θ'=>'th', 'θ'=>'th', 'Ι'=>'i', 'ι'=>'i', 'ί'=>'i', 'Κ'=>'k', 'κ'=>'k',
        'Λ'=>'l', 'λ'=>'l', 'Μ'=>'m', 'μ'=>'m', 'Ν'=>'n', 'ν'=>'n', 'Ξ'=>'x', 'ξ'=>'x', 'Ο'=>'o', 'ο'=>'o', 'ό'=>'o', 'Π'=>'p',
        'π'=>'p', 'Ρ'=>'r', 'ρ'=>'r', 'Σ'=>'s', 'σ'=>'s', 'ς'=>'s', 'Τ'=>'t', 'τ'=>'t', 'Υ'=>'y', 'υ'=>'y', 'ύ'=>'y', 'Φ'=>'f',
        'φ'=>'f', 'Χ'=>'ch', 'χ'=>'ch', 'Ψ'=>'ps', 'ψ'=>'ps', 'Ω'=>'o', 'ω'=>'o', 'ὼ'=>'o', 'ώ'=>'o', 'Ї'=>'i', 'ї'=>'i', 'є' => 'e'
   
        
		);


        // prevede vsechna velka pismena na mala
    $address = strtolower ($address); 
    
    // nahradi znaky s diakritikou na znaky bez diakritiky
    $address = StrTr ($address, $table);



    // nahradi pomlckou vsechny znanky, ktera nejsou pismena nebo cisla
    $re = "/[^[:alpha:][:digit:]]/";
    $replacement = "-";
    $address = preg_replace ($re, $replacement, $address);

    // odstrani ze zacatku a z konce retezce pomlcky
    $address = trim ($address, "-");

    // odstrani z adresy pomlcky, pokud jsou dve a vice vedle sebe
    $re = "/[-]+/";
    $replacement = "-";
    $address = preg_replace ($re, $replacement, $address);

    return $address;
}

